package learn

// 值类型: 数组，基础数据类型，结构体
// 引用类型: 切片，字典，通道，函数

// len: 长度
// cap: 容量，切片的容量实际上代表了底层数组的长度
// make:

import "fmt"

func LearnSlice() {
	// 如何创建一个数组
	// 如果修改底层数组元素的值，切片元素的值也会改变
	s0 := [10]int{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
	// 如何创建一个切片
	// s1 := []int{0,0,0,0,0}
	// s1 := make([]int, 5)
	// 切片的底层就是数组，修改切片元素的值，实际上就是修改底层数组元素的值
	s1 := s0[2:7]
	s2 := s0[5:10]
	fmt.Println(s1)
	fmt.Println(s2)
	s1[4] = 99
	s2[0] = 111
	fmt.Println(s1)
	fmt.Println(s2)
	// 切片只能向右扩展，无法向左扩展
	x := s1[0:cap(s1)]
	print(x)
}
